In [1]:
import numpy as np
from sklearn.impute import SimpleImputer
import pandas as pd

In [2]:
data = pd.read_csv('data.csv')
print(data.shape)

(11, 4)

In [3]:
data.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [21]:
imp = SimpleImputer(missing_values=np.nan, strategy='mean')

In [23]:
imp = imp.fit(data[['Age', 'Salary']])

In [24]:
data[['Age', 'Salary']] = imp.transform(data[['Age', 'Salary']])

In [25]:
data

    Country   Age   Salary Purchased
0    France  44.0  72000.0        No
1     Spain  27.0  48000.0       Yes
2   Germany  30.0  54000.0        No
3     Spain  38.0  61000.0        No
4   Germany  40.0  63900.0       Yes
5    France  35.0  58000.0       Yes
6     Spain  38.5  52000.0        No
7    France  48.0  79000.0       Yes
8   Germany  50.0  83000.0        No
9    France  37.0  67000.0       Yes
10    India  36.0  65000.0       Yes